app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
	def index
		if user_signed_in?
			@items= Item.where(:user_id => current_user.id).order("created_at DESC")

INSERT INTO "items" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
	def create
		@item=current_user.items.build(item_params)
		if @item.save

UPDATE "items" SET "title" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", "Better Items"], ["updated_at", "2019-06-28 13:07:45.799430"], ["id", 2]]
---
	def update
		if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "completed_at" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed_at", "2019-07-01 07:50:39.607811"], ["updated_at", "2019-07-01 07:50:39.608135"], ["id", 11]]
---
	def complete
		@item=Item.find(params[:id])
		@item.update_attribute(:completed_at,Time.now)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def find_item
    	@item=Item.find(params[:id])